<!doctype html public "-//w3c//dtd html 4.0 transitional//en">
<html>
<head>
   <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
   <meta name="GENERATOR" content="Mozilla/4.73 [fr] (X11; I; Linux 2.2.17 i686) [Netscape]">
</head>
<body text="#000000" bgcolor="#FFFFFF" link="#0000EF" vlink="#51188E" alink="#FF0000">

<center><b><font face="Arial,Helvetica"><font color="#999999"><font size=+2>M&eacute;canisme
de distribution des t&acirc;ches.</font></font></font></b><b><font face="Arial,Helvetica"><font color="#000099"><font size=+2></font></font></font></b>
<p>
<hr SIZE=4 NOSHADE WIDTH="100%"></center>
<b><font face="Arial,Helvetica"><font color="#CCCCCC"><font size=+1></font></font></font></b>
<p><br><b><font face="Arial,Helvetica"><font color="#CCCCCC"><font size=+1></font></font></font></b>
<center><table COLS=1 WIDTH="100%" NOSAVE >
<tr BGCOLOR="#666666" NOSAVE>
<td NOSAVE><b><font face="Arial,Helvetica"><font color="#CCCCCC"><font size=+1>L'algorithme
original.</font></font></font></b></td>
</tr>

<tr>
<td></td>
</tr>

<tr NOSAVE>
<td NOSAVE>L'algorithme original faisait du <tt>TaskDispatcher</tt> l'initiateur
de la distribution des t&acirc;ches. Lorsqu'une nouvelle t&acirc;che &eacute;tait
d&eacute;pos&eacute;e par le <tt>TaskManager,</tt> une plateforme &eacute;tait
choisie dans l'ensemble des plateformes disponibles, puis la t&acirc;che
&eacute;tait envoy&eacute;e. Ce m&eacute;canisme pr&eacute;sente plusieurs
d&eacute;fauts :
<ul>
<li>
de nombreuses t&acirc;ches sont cr&eacute;&eacute;es sur les <tt>PlateformManager</tt>,
d'o&ugrave; une consommation importante de ressources (il faut un <i>thread
</i>par t&acirc;che) et donc une d&eacute;gradation des performances sur
l'&eacute;l&eacute;ment assurant le calcul. De plus, cette cr&eacute;ation
est <i>a priori</i> ind&eacute;pendante du syst&egrave;me abritant la plateforme.
La distribution ne prend donc pas en compte des crit&egrave;res comme la
charge (qui peut varier au cours du temps) ou les capacit&eacute;s de la
machine;</li>

<li>
une prise en charge correcte <i>load-balancing , </i>si tent&eacute; qu'elle
soit possible<i>, </i>pourrait se faire par l'emploi d'objets du type <tt>Selector</tt>
mais la prise en compte des diff&eacute;rentes caract&eacute;ristiques
techniques des machines est un probl&egrave;me extr&ecirc;mement compliqu&eacute;
qui d&eacute;pend du mat&eacute;riel, du syst&egrave;me d'exploitation
et de la charge (variable) &agrave; un moment donn&eacute;;</li>

<li>
si une plateforme tombe, de nombreuses t&acirc;ches sont perdues et le
m&eacute;canisme de <i>timeout</i> mettra du temps avant de relancer les
t&acirc;ches.</li>
</ul>
Pour rem&eacute;dier &agrave; ce probl&egrave;me, un <i>m&eacute;canisme
de r&eacute;partition implicite </i>a &eacute;t&eacute; mis en place .</td>
</tr>

<tr>
<td></td>
</tr>

<tr BGCOLOR="#666666" NOSAVE>
<td NOSAVE><b><font face="Arial,Helvetica"><font color="#CCCCCC"><font size=+1>L'algorithme
de r&eacute;partition implicite.</font></font></font></b></td>
</tr>

<tr>
<td></td>
</tr>

<tr>
<td>L'id&eacute;e de l'algorithme est simple: il suffit que la distribution
des t&acirc;ches ne se fasse plus &agrave; l'initiative du <tt>TaskDispatcher</tt><font face="Arial,Helvetica">
</font>mais plut&ocirc;t &agrave; la demande des <tt>PlatformManager </tt>eux-m&ecirc;mes.
Ainsi, les <tt>PlatformManager</tt> ne g&eacute;rent qu'un nombre fixe
de <tt>ReckonerAgent</tt> qui existent d&egrave;s la cr&eacute;ation du
<tt>PlatformManager.</tt> Chaque agent calculateur se voit affecter une
t&acirc;che, et d&egrave;s que le calcul a &eacute;t&eacute; men&eacute;
&agrave; son terme, le <tt>PlatformManager</tt> demande une nouvelle t&acirc;che
au&nbsp; <tt>TaskDispatcher</tt> et l'affecte &agrave; l'agent libre. Les
avantages de ce m&eacute;canisme sont :
<ul>
<li>
la r&eacute;solution du probl&egrave;me d'adaptation &agrave; une charge
de travail variable (au cours du temps et selon l'utilisation qu'il est
faite de la machine abritant la plateforme). En effet, si la charge de
la machine augmente, le temps de calcul des diff&eacute;rentes t&acirc;ches
va s'accro&icirc;tre et la machine demandera moins de t&acirc;che. On &eacute;vitera
ainsi une surcharge pr&eacute;judiciable. Inversement, si la machine est
peu charg&eacute;e, elle terminera plus vite le calcul de ses t&acirc;ches
et pourra donc demander beaucoup plus de t&acirc;ches. Chaque plateforme
s'adapte donc naturellement &agrave; sa propre charge;</li>

<li>
une plus grande s&eacute;curit&eacute; puisque le nombre de t&acirc;ches
s'ex&eacute;cutant sur une machine donn&eacute;e est moindre. Cependant,
le m&eacute;canisme de <i>timeout</i> est conserv&eacute;;</li>

<li>
l'am&eacute;lioration de la possibilit&eacute; d'ajouter ou de retirer
des <tt>PlatformManager</tt> "&agrave; la vol&eacute;e".&nbsp;&nbsp;</li>
</ul>
</td>
</tr>

<tr>
<td></td>
</tr>
</table></center>
<b><font face="Arial,Helvetica"><font color="#000099"><font size=+1></font></font></font></b>
</body>
</html>
